tests/test_04_mahywansi2024/cases/S1_JHR2024_continuous_air_validation/openfoam/2d/mesh_levels/medium_refine/case/constant/g
FoamFile
{
    version     2.0;
    format      ascii;
    class       uniformDimensionedVectorField;
    object      g;
}

dimensions      [0 1 -2 0 0 0 0];
value           (0 0 -9.81);

