tests/test_04_mahywansi2024/cases/S1_JHR2024_continuous_air_validation/openfoam/2d/mesh_levels/medium_refine/case/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
116750
(
107168.59
107168.59
107168.59
107168.59
107168.59
107168.59
107168.59
107168.59
...
)
;

boundaryField
{
    waterInlet
    {
        type            calculated;
        value           uniform 107051.98;
    }
    waterOutlet
    {
        type            calculated;
        value           uniform 107051.98;
    }
    airInlet
    {
        type            calculated;
        value           uniform 107051.98;
    }
    ambientFloor
    {
        type            calculated;
        value           uniform 101325;
    }
    ambientSides
    {
        type            calculated;
        value           uniform 101325;
    }
    ambientTop
    {
        type            calculated;
        value           uniform 101325;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<scalar> 
4844
(
107051.98
107051.98
107051.98
107051.98
107051.98
107051.98
107051.98
107051.98
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
