tests/test_04_mahywansi2024/cases/S1_JHR2024_continuous_air_validation/openfoam/2d/mesh_levels/medium_refine/case/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

ddtSchemes
{
    // Fluent's published scheme is described only as implicit bounded
    // second-order. compressibleInterFoam v2512 rejects `backward`, so the
    // OpenFOAM translation uses a 0.9 off-centred Crank-Nicolson scheme.
    default         CrankNicolson 0.9;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    div(phi,alpha)                          Gauss vanLeer;
    div(phirb,alpha)                        Gauss linear;
    div(phi,thermo:rho.water)               Gauss limitedLinear 1;
    div(phi,thermo:rho.air)                 Gauss limitedLinear 1;
    div(rhoPhi,U)                           Gauss limitedLinearV 1;
    div(rhoPhi,T)                           Gauss limitedLinear 1;
    div(rhoPhi,K)                           Gauss limitedLinear 1;
    div(phi,p)                              Gauss limitedLinear 1;
    div(rhoPhi,k)                           Gauss limitedLinear 1;
    div(rhoPhi,omega)                       Gauss limitedLinear 1;
    div(((rho*nuEff)*dev2(T(grad(U)))))     Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method          meshWave;
}
