tests/test_04_mahywansi2024/cases/S1_JHR2024_continuous_air_validation/openfoam/2d/mesh_levels/medium_refine/case/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    Phi
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-10;
        relTol          0;
        maxIter         500;
    }

    "alpha.water.*"
    {
        nAlphaCorr      2;
        // v2512 forbids alpha sub-cycling with Crank-Nicolson.  Keep the
        // source-aligned corrector/limiter counts but advance alpha once per
        // global step as an explicit OpenFOAM compatibility translation.
        nAlphaSubCycles 1;
        cAlpha          1;
        MULESCorr       no;
        nLimiterIter    5;
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }

    "pcorr.*"
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-5;
            relTol          0;
            smoother        DICGaussSeidel;
        }
        tolerance       1e-5;
        relTol          0;
        maxIter         100;
    }

    ".*(rho|rhoFinal)"
    {
        solver          diagonal;
    }

    p_rgh
    {
        solver          GAMG;
        tolerance       1e-7;
        relTol          0.01;
        smoother        DIC;
    }

    p_rghFinal
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-7;
            relTol          0;
            nVcycles        2;
            smoother        DICGaussSeidel;
            nPreSweeps      2;
        }
        tolerance       1e-7;
        relTol          0;
        maxIter         100;
    }

    "U.*"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-6;
        relTol          0.01;
        nSweeps         1;
    }

    "(T|k|omega|B|nuTilda).*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0.01;
        maxIter         100;
    }
}

PIMPLE
{
    momentumPredictor          yes;
    transonic                  no;
    nOuterCorrectors           1;
    nCorrectors                2;
    nNonOrthogonalCorrectors   0;
}
